[
    {
        "id": 0,
        "name": "React.js",
        "icon": "https://upload.wikimedia.org/wikipedia/commons/a/a7/React-icon.svg",
        "par": ["React (también llamada React.js o ReactJS) es una biblioteca Javascript de código abierto diseñada para crear interfaces de usuario con el objetivo de facilitar el desarrollo de aplicaciones en una sola página.", "Es mantenido por Facebook y la comunidad de software libre. En el proyecto hay más de mil desarrolladores libres. React intenta ayudar a los desarrolladores a construir aplicaciones que usan datos que cambian todo el tiempo.", "Su objetivo es ser sencillo, declarativo y fácil de combinar. React sólo maneja la interfaz de usuario en una aplicación; React es la Vista en un contexto en el que se use el patrón MVC (Modelo-Vista-Controlador) o MVVM (Modelo-vista-modelo de vista). También puede ser utilizado con las extensiones de React-based que se encargan de las partes no-UI (que no forman parte de la interfaz de usuario) de una aplicación web.", "Según el servicio de análisis JavaScript (en inglés 'JavaScript analytics service'), Libscore, React actualmente está siendo utilizado en las páginas principales de Imgur, Bleacher Informe, Feedly, Airbnb, SeatGeek, HelloSign, entre otras."]
    },
    {
        "id": 1,
        "name": "Bootstrap 5",
        "icon": "https://upload.wikimedia.org/wikipedia/commons/a/a7/React-icon.svg",
        "par": ["Bootstrap es una biblioteca multiplataforma o conjunto de herramientas de código abierto para diseño de sitios y aplicaciones web. Contiene plantillas de diseño con tipografía, formularios, botones, cuadros, menús de navegación y otros elementos de diseño basado en HTML y CSS, así como extensiones de JavaScript adicionales.", "A diferencia de muchos frameworks web, solo se ocupa del desarrollo front-end. Bootstrap es el segundo proyecto más destacado en GitHub y es usado por la NASA y la MSNBC, entre otras organizaciones.", "Tiene un soporte relativamente incompleto para HTML5 y CSS3, pero es compatible con la mayoría de los navegadores web. La información básica de compatibilidad de sitios web o aplicaciones está disponible para todos los dispositivos y navegadores."]
    },
    {
        "id": 2,
        "name": "TailWind CSS",
        "icon": "https://www.vectorlogo.zone/logos/tailwindcss/tailwindcss-ar21.svg",
        "par": ["Tailwind CSS es un framework de CSS de código abierto para el diseño de páginas web. La principal característica de esta biblioteca es que, a diferencia de otras como Bootstrap, no genera una serie de clases predefinidas para elementos como botones o tablas. En su lugar, crea una lista de clases CSS 'de utilidad' que se pueden usar para dar estilos individuales a cada elemento.", "Debido a la diferencia de conceptos básicos en relación con otros sistemas de diseño tradicionales como Bootstrap, es importante conocer la filosofía a partir de la que se creó Tailwind, así como su funcionamiento básico."]
    },
    {
        "id": 3,
        "name": "Fleet",
        "icon": "https://www.jetbrains.com/_assets/www/fleet/inc/overview-content/img/fleet-logo.65f4a04c59fc3ba93bb5e181050891c5.png",
        "par": ["JetBrains Fleet es un nuevo editor de programación multilingüe y un entorno de desarrollo integrado que refleja el intento de JetBrains de reinventar el entorno de desarrollo integrado. Fleet es distinto del trabajo en curso de JetBrains para rediseñar las interfaces de usuario y las experiencias de usuario de sus IDE existentes, como IntelliJ IDEA, sin alterar las capacidades e integraciones centradas en el código de los IDE.", "Fleet utiliza el motor de procesamiento de código IntelliJ para Java. En lugar de usar el motor de IntelliJ, Fleet usa un servidor de varios idiomas, similar a Visual Studio Code."]
    }
]